CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OneSpandrelOutputInfo Method
 Represents Rebars in one Spandrel on a particular story , as defined in ETABS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OneSpandrelOutputInfo(
	int WallStackIndex,
	int SpandrelIndex,
	ref string GUID,
	ref string Name,
	ref double Height,
	ref double Width,
	ref double Thickness,
	ref double CoverLongBar,
	ref double CoverStirrups,
	ref double x1,
	ref double y1,
	ref double z1,
	ref double x2,
	ref double y2,
	ref double z2,
	ref int NumberLongBars,
	ref int NumberStirrups,
	ref int TotalAreaObjects,
	ref string[] AreaObjectNames
)
Function GetDetailedWall_OneWallStack_OneSpandrelOutputInfo (
	WallStackIndex As Integer,
	SpandrelIndex As Integer,
	ByRef GUID As String,
	ByRef Name As String,
	ByRef Height As Double,
	ByRef Width As Double,
	ByRef Thickness As Double,
	ByRef CoverLongBar As Double,
	ByRef CoverStirrups As Double,
	ByRef x1 As Double,
	ByRef y1 As Double,
	ByRef z1 As Double,
	ByRef x2 As Double,
	ByRef y2 As Double,
	ByRef z2 As Double,
	ByRef NumberLongBars As Integer,
	ByRef NumberStirrups As Integer,
	ByRef TotalAreaObjects As Integer,
	ByRef AreaObjectNames As String()
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim SpandrelIndex As Integer
Dim GUID As String
Dim Name As String
Dim Height As Double
Dim Width As Double
Dim Thickness As Double
Dim CoverLongBar As Double
Dim CoverStirrups As Double
Dim x1 As Double
Dim y1 As Double
Dim z1 As Double
Dim x2 As Double
Dim y2 As Double
Dim z2 As Double
Dim NumberLongBars As Integer
Dim NumberStirrups As Integer
Dim TotalAreaObjects As Integer
Dim AreaObjectNames As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OneSpandrelOutputInfo(WallStackIndex,
	SpandrelIndex, GUID, Name, Height,
	Width, Thickness, CoverLongBar, CoverStirrups,
	x1, y1, z1, x2, y2, z2, NumberLongBars,
	NumberStirrups, TotalAreaObjects,
	AreaObjectNames)
int GetDetailedWall_OneWallStack_OneSpandrelOutputInfo(
	int WallStackIndex,
	int SpandrelIndex,
	String^% GUID,
	String^% Name,
	double% Height,
	double% Width,
	double% Thickness,
	double% CoverLongBar,
	double% CoverStirrups,
	double% x1,
	double% y1,
	double% z1,
	double% x2,
	double% y2,
	double% z2,
	int% NumberLongBars,
	int% NumberStirrups,
	int% TotalAreaObjects,
	array<String^>^% AreaObjectNames
)
abstract GetDetailedWall_OneWallStack_OneSpandrelOutputInfo :
        WallStackIndex : int *
        SpandrelIndex : int *
        GUID : string byref *
        Name : string byref *
        Height : float byref *
        Width : float byref *
        Thickness : float byref *
        CoverLongBar : float byref *
        CoverStirrups : float byref *
        x1 : float byref *
        y1 : float byref *
        z1 : float byref *
        x2 : float byref *
        y2 : float byref *
        z2 : float byref *
        NumberLongBars : int byref *
        NumberStirrups : int byref *
        TotalAreaObjects : int byref *
        AreaObjectNames : string[] byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
SpandrelIndex
Type: System.Int32
 Spandrel Output Index
GUID
Type: System.String
 GUID
Name
Type: System.String
 Name of Spandrel
Height
Type: System.Double
 Spandrel Height
Width
Type: System.Double
 Spandrel Width
Thickness
Type: System.Double
 Spandrel Thickness
CoverLongBar
Type: System.Double
 Cover for LongBar
CoverStirrups
Type: System.Double
 Cover for Stirrup
x1
Type: System.Double
 Global Centerline of Spandrel. Matching with ETABS Design leg data X1
y1
Type: System.Double
 Global Centerline of Spandrel. Matching with ETABS Design leg data Y1
z1
Type: System.Double
 Global Centerline of Spandrel. Matching with ETABS Design leg data Z1
x2
Type: System.Double
 Global Centerline of Spandrel. Matching with ETABS Design leg data X2
y2
Type: System.Double
 Global Centerline of Spandrel. Matching with ETABS Design leg data Y2
z2
Type: System.Double
 Global Centerline of Spandrel. Matching with ETABS Design leg data Z2
NumberLongBars
Type: System.Int32
 Contains all Longitudinal Rebars in a beam
NumberStirrups
Type: System.Int32
 Represents one Zone of Stirrups with same size and spacing
TotalAreaObjects
Type: System.Int32
 Total number of ETABS Area Objects
AreaObjectNames
Type: System.String[]
 ETABS Area Object Name
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace